// - შექმენით მასივი და შეავსეთ იგი 10 ნებისმიერი ელემენტით.
// შემდეგ slice მეთოდით:
//  დააკოპირეთ ორიგინალი მასივი და დაბეჭდეთ
// მესამე ელემენტიდან ყველა დაასლაისეთ და გამოიტანეთ ეკრანზე
// მეხუთე ელემენტიდან მეცხრე ელემენტამდე დაასლაისეთ და გამოიტანეთ ეკრანზე
// ბოლო 5 ელემენტი  დაასლაისეთ და გამოიტანეთ ეკრანზე

// - გაქვთ შემდეგი მასივი: ['Vakhtang', 'Ani', "Giorgi', "Irakli', 'Levani']
// იპოვეთ გიორგის ინდექსი და იქიდან ბოლომდე, დაასლაისეთ ელემენტები და დაბეჭდეთ ეკრანზე

// - გაქვთ შემდეგი ტიპის მასივი. [1, 5, 10, 13]
// იპოვეთ 10ის ინდექსი და იქ ჩასვით 11 და 12.  (splice)

// - გაქვთ შემდეგი ტიპის მასივი [1, 2, 3, 4, 5, 7, 9, 10, 12]
// იპოვეთ სადაა გამოტოვებული ელემენტები(მაგალითად 7სა და 9ს შორის 8 აკლია) და ჩასვით ისინი.
//(არ გჭირდებათ indexOf. ტრადიციული for და splice საკმარისია)
// სცადეთ ახლა იგივე შემდეგ მასივზე: [1, 2, 5, 7, 9, 10, 15).

// - დაწერეთ კოდი, რომელიც გადაწოდებულ მასივს, შეატრიალებს.
//(მაგალითად [ 1, 5, 10, 3, 20, 30] -> [30, 20, 3, 10, 5, 1] ან
//['Ani', 'Giorgi', 'Levani' "Irakli'] -> ['Irakli', 'Levani', 'Giorgi', 'Ani'].
//სცადეთ reverse და reverseის გარეშეც ამის გაკეთება.

// ჩაწერეთ მასივში 10 რენდომ რიცხვი 10დან 100მდე. ჩაწერეთ უნიკალური რიცხვები.
// რიცხვები, რომლებიც 50ზე მეტია, ამოიღეთ მასივიდან.

// let arr = [];
// for (let i = 0; i < 10; i++) {
//   const rndNumber = Math.floor(Math.random() * 91) + 10;
//   arr.push(rndNumber);
// }

// for (let i = 0; i < arr.length; i++) {
//   if (arr[i] > 50) {
//     arr.splice(i, 1);
//     i--;
//   }
// }

// let months = ['Jan', 'Feb', 'March', 'April', 'June'];
// // months.splice(1, 0, 'Feb');
// // Inserts at index 1
// // Expected output: Array ["Jan", "Feb", "March", "April", "June"]

// months.splice(months.length, 0, 'May');
// // Replaces 1 element at index 4
// console.log(months);

// const slicedArr = months.slice(2);
// console.log(months);
// console.log({ slicedArr });

const arr = [1, 2, 3, 4, 9, 10, 12]; // i == 1
for (let i = 1; i < arr.length; i++) {
  if (arr[i] - arr[i - 1] >= 2) {
    arr.splice(i, 0, arr[i] - 1); // პირველად აქ რომ მოვა ამ მასივზე,9ის წინ ჩაგვიწერს 8.
    i--;
  }
}
console.log(arr);
