// ჩაწერეთ მასივში მხოლოდ 10 რენდომ რიცხვი 10დან 50მდე.

// დათვალეთ ჯამი მასივში ჩაწერული რიცხვების.

// ჩაწერეთ მასივში 20 რენდომ რიცხვი 0დან 200მდე.
// გადაუარეთ ამ მასივს და დაბეჭდეთ მხოლოდ კენტი რიცხვები.
// დათვალეთ რამდენი კენტი რიცხვია.

// ჩაწერეთ მასივში 10 რიცხვი 10დან 25მდე.
// გაიგეთ ეს მასივი შეიცავს თუ არა უნიკალურ რიხვებს.

// ჩაწერეთ მასივში 10 რენდომ უნიკალური რიცხვი 20დან 50მდე შუალედში.
// აუცილებელი პირობაა ეს რიცხვები იყოს უნიკალური

// ჩაწერეთ მასივში 10 რიცხვი 10დან 25მდე. (10, 11, 12, 13, 14)
// წაშალეთ მასივიდან ყველა ლუწი რიცხვი.

//ჩაწერეთ მასივში 10 რენდომ რიცხვი 20დან 50მდე შუალედში. აუცილებელი პირობაა
//რომ მასივში თუკი უკვე წერია ეს რიცხვი, აღარ ჩაწეროთ. ანუ მასივში უნდა ეწეროს
//უნიკალური რიცხვები.

// ჩაწერეთ მასივში 10 რენდომ რიცხვი 10დან 100მდე. ჩაწერეთ უნიკალური რიცხვები.
// რიცხვები, რომლებიც 50ზე მეტია, ამოიღეთ მასივიდან.
