// დავალება 1
// შემოაყვანინე მომხარებელს საკუთარი სახელი და დაბადების წელი.
// გამოთვალე მისი ასაკი და დაბეჭდე ალერთად და კონსოლში.

// დავალება 2
//შექმენით ცვლადი სადაც მომხმარებელს თხოვთ რომ შემოიტანოს საკუთარი ასაკი,
//იმ შემთხვევაში თუ ასაკი მეტია ან ტოლია 18 წლის, თხოვთ რომ შემოიტანოს სახელი
//და გვარი და საბოლოოდ დაბეჭდავთ კონსოლში გამარჯობა “name” “surname”,
//იმ შემთქვევაში თუ ასაკი 18 წელზე ნაკლებია დაბეჭდავთ თქვენ ხართ არასრულწლოვანი

// დავალება 3
// დაწერეთ რა?სად?როდის? ტიპის თამაში, დაუსვით მომხმარებელს 3 კითხვა
//სავარაუდო 4 პასუხით  დაელოდეთ მომხმარებლის მიერ შემოტანილ პასუხს ყოველი
//დასმული კითხვის შემდეგ და დაითვალეთ თუ რამდენ კითხვას უპასუხებს მომხმარებელი
//სწორად.

// დავალება 4
//შექმენით კალკულატორი, კალკულატორს უნდა შეეძლოს მომხმარებლის მიერ შემოტანილ 2
//რიცხვზე გარკვეული მათემატიკური ოპერაციის შესრულება რომელსაც მომხმარებელი
//აირჩევს, მათემატიკური მოქმედებები შემდეგია („+“ , “ –„ , “ *“ , “ /“ , “ =“ )
